def choice():

    menue_name = [
        ["元祖ももから",220,270,360,620],
        ["スタミナ唐揚げ",250,310,420,640],
        ["スタミナDX",-1,360,470,720],
        ["甘辛チキン",270,350,-1,-1],
        ["ピリ辛一味",-1,350,440,730],
        ["チキン南蛮",-1,330,420,710],
        ["明太マヨ",-1,350,440,730],
        ["スウィートチリマヨ",-1,360,450,740],
        ["フライドポテト",-1,150,280,-1],
        ["ご飯",100,150,200,250],
        ["ハーフ＆ハーフ",-1,320,450,560]
    ]

    return menue_name

def tanpin():

    tanpin_menue = [
        ["コロッケ",90],
        ["クリームコロッケ",120],
        ["メンチカツ",100],
        ["エビカツ",150],
        ["春巻",100],
        ["焼き鳥2本",360],
        ["フランクフルト",200],
        ["チキンカツ",180],
        ["アジフライ",140],
        ["白身魚フライ",120],
        ["エビフライ",150],
        ["ハムカツ",140],
        ["玉ねぎ唐揚げ 1/4",50],
        ["グリーンサラダ",100],
        ["コーンサラダ",130],
        ["マカロニサラダ",100],
        ["中華サラダ",100],
        ["枝豆",150],
        ["たこ焼き 6個",270],
        ["たこ焼き 10個",430],
        ["豚ロースカツ 3枚",390],
        ["豚ロースカツ 5枚",650],
        ["とり天 6個",340],
        ["とり天 9個",490],
        ["ちくわ 1本",170],
        ["揚がれ！たい焼き君 1匹",80],
        ["手羽先唐揚げ 1本",130],

    ]
    return tanpin_menue

def teisyoku_bentou():
    TB_menue = [
        ["王道三種盛",660,790,900],
        ["甘辛チキンマヨ",580,680,980],
        ["元祖ももから",470,560,820],
        ["スタミナ唐揚げ",520,630,850],
        ["ハーフ＆ハーフ",530,660,770],
        ["とり天 6個",520],
        ["とり天 9個",670],
        ["甘ピリハーフ",680,780,930],
        ["手羽盛 3本",600],
        ["手羽盛 5本",860],
        ["コロッケ・スペシャル",620,750,860],
        ["白身フライ・スペシャル",650,780,890],
        ["アジフライ・スペシャル",670,800,910],
        ["メンチカツ・スペシャル",630,760,870],
        ["ハムカツ・スペシャル",670,800,910],
        ["エビカツ・スペシャル",680,810,920],
        ["エビフライ・スペシャル",680,810,920],
        ["スタミナDX",570,680,930],
        ["ピリ辛一味",560,650,940],
        ["ピリ辛一味マヨ",580,670,960],
        ["南蛮",540,630,920],
        ["明太マヨ",560,650,940],
        ["チリマヨ",570,660,950],
        ["三色",890,1070,-1],
        ["白身フライ",550,600,690,950],
        ["アジフライ",570,620,710,970],
        ["エビカツ",580,630,720,980],
        ["エビフライ",730,780,870,1130],
        ["メンチカツ",630,680,770,1030],
        ["ハムカツ",710,760,850,1110],
        ["ハム・メンチカツ",670,720,810,1070],
        ["コロッケ",520,570,660,920],
        ["つけから",550,640,900],
        ["焼き鳥 2本",510],
        ["焼き鳥 3本",660],
        ["カツ盛",740],
        ["チキンカツ",570],
        ["豚ロース 3枚",600],
        ["豚ロース 5枚",860],
        ["甘辛チキンマヨ丼",570,670,970],
        ["ピリ辛一味丼",550,640,930],
        ["チリマヨ丼",560,650,940],
        ["焼き鳥丼",510,600,-1],
        ["南蛮丼",530,620,910],
        ["明太マヨ丼",550,640,930],
        ["エビフライソース丼 3本",650],
        ["エビフライソース丼 5本",950],
        ["フランクセット",710],
        ["カレー",-1],


    ]
    return TB_menue


def curry():
    curry_menue = [
        ["ビーフカレー",470],
        ["コロッケカレー",560],
        ["フィッシュカレー",590],
        ["エビカツカレー",620],
        ["メンチカツカレー",570],
        ["フランクフルトカレー",670],
        ["スタミナカレー",720],
        ["たこ焼きカレー",740],
        ["エビフライカレー",770],
        ["チキンカツカレー",650],
        ["豚ロースカツカレー",860],

    ]
    return curry_menue


def special_menue():

    special = [
        "とり天 6個",
        "とり天 9個",
        "手羽盛 3本",
        "手羽盛 5本",
        "チキンカツ",
        "カツ盛",
        "豚ロース 3枚",
        "豚ロース 5枚",
        "焼き鳥 2本",
        "焼き鳥 3本",
        "カレー",
        "フランクセット",
        "エビフライソース丼 3本",
        "エビフライソース丼 5本",
    ]

    return special


def arrange_menue():
    menue = [     
        "白身フライ",
        "アジフライ",
        "エビカツ",
        "エビフライ",
        "メンチカツ",
        "ハムカツ",
        "ハム・メンチカツ",
        "コロッケ"
    ]

    return menue
